Hall_of_Fame/app/views/users/show_user_details.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
        <li class="list-group-item text-right"><span class="pull-left"><strong>Dernière connexion </strong></span> <%=time_ago_in_words(@user.current_sign_in_at)%></li>
        <li class="list-group-item text-right"><span class="pull-left"><strong>Nombre de posts</strong></span><%=@user.posts.count%></li>