Hall_of_Fame/app/controllers/comments_controller.rb

INSERT INTO "comments" ("commentable_id", "commentable_type", "body", "user_id", "created_at", "updated_at", "lft", "rgt") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "comments" SET "lft" = CASE WHEN "lft" BETWEEN 6 AND 6 THEN "lft" + 8 - 6 WHEN "lft" BETWEEN 7 AND 8 THEN "lft" + 6 - 7 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 6 AND 6 THEN "rgt" + 8 - 6 WHEN "rgt" BETWEEN 7 AND 8 THEN "rgt" + 6 - 7 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 4 THEN 3 ELSE "parent_id" END, updated_at = '2016-05-19 17:34:18.296473' WHERE "comments"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."commentable_id" = $1 AND "comments"."commentable_type" = $2 AND ("comments"."lft" BETWEEN 6 AND 8 OR "comments"."rgt" BETWEEN 6 AND 8)  ORDER BY "comments"."lft")  [["commentable_id", 1], ["commentable_type", "Post"]]
---
  def create
    commentable = commentable_type.constantize.find(commentable_id)
    @comment = Comment.build_from(commentable, current_user.id, body)

    respond_to do |format|
      if @comment.save