Hall_of_Fame/app/controllers/posts_controller.rb

  def upvote
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def downvote
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def index
  	@post=Post.paginate(:page => params[:page])
---
SELECT  "posts".* FROM "posts" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create

    if current_user
      @user = current_user
      @post = @user.posts.build(post_params)
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "up_vote", "down_vote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "dfssdffsd"], ["content", "dsfsdffsd"], ["user_id", 1], ["up_vote", 0], ["down_vote", 0], ["created_at", "2016-05-18 17:32:30.284075"], ["updated_at", "2016-05-18 17:32:30.284075"]]

  def random
    @post=Post.order("RANDOM()").paginate(:page => params[:page])
---
SELECT  "posts".* FROM "posts"  ORDER BY RANDOM() LIMIT 30 OFFSET 0