Hall_of_Fame/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(:page => params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show_user_details
    @user = User.find(params[:id])